IF  EXISTS (SELECT * FROM sys.views WHERE object_id = OBJECT_ID(N'[dbo].[vi_zy_newhishsz]'))
DROP VIEW [dbo].[vi_zy_newhishsz]
GO
CREATE view [dbo].[vi_zy_newhishsz]
as
/*
上了住院护士站的科室ID
*/
select 0 deptid
union
select dept_id from JC_DEPT_PROPERTY 
where (select CONFIG from JC_CONFIG where ID=6220)='1' 
or DEPT_ID in 
(
 0,599,600,712,713,715,721,746,254,255,
 230,231,154,155,601,602,603,604,657,656,
 635,634,720,719,
 750,751,752,753,
 729,730,118,119,241,242,
 258,259,39,40,422,423,346,347,356,357,302,303,348,349,464,465,295,296,448,449,380,381,297,298,
 138,139,329,330,273,274,394,395,396,397,185,186,226,227,563,564,467,
 27,28,354,355,757,758,27,28,514,515,565,481,482,512,513,202,203,
 509,508,123,122,15,16,506,507,
 264,265,
 350,351,76,77,352,353,179,180,305,306,479,480,
 80,81,250,251,325,326,
 522,523,182,183,51,52,61,62,562,
 764,765,
 288,289,510,511,33,34,401,402,372,373,525,526,98,99,385,386,252,253,561,
 454,455,23,24,456,457,65,66,529,530,452,453,
 608,609,610,611,612,613,
 618,619,620,621,622,623,
 630,631,632,633,716,722,636,637,745,638,639,640,641,
 625,626,627,726,654,655,658,659,660,661,
 644,645,646,647,648,649,650,651,652,653,
 278,279,614,615,616,617,717,718,
 786,787,781,782,
 307,308,
 663,662,707,709,711,710,706,708
)
/*
11-27 肿瘤五后湖
12-10 胸外康复后湖
12-15 肿瘤六后湖
12-22 肿瘤一二三四后湖
12-25 眼科
12-25 风湿与肾病内科
01-05 血管外科（后湖）皮肤科医学整形科（后湖）
01-07 综合二科 后湖
02-04 血液科、干细胞移植部 南院
03-09 博爱楼（呼吸内科一病区、呼吸内科二病区、呼吸内科RCU、心血管内科一、二、三、CCU一、二病区、内分泌科一、二、三、监护病区）
03-11 泰康楼（肾病内科病房、肾病内科监护室、康复科、中医科、中西医结合肿瘤、综合6科、综合5科）
03-16 泰康楼（综合3科、综合2科、综合2科监护室、综合1科、皮肤科、疼痛科、整形外科）
03-18 安康楼（眼科一区、眼科二区、耳鼻喉一区、耳鼻喉二区）
03-23 增加血液科监护室
03-23 仁济楼（神经内科一病区、神经内科二病区、神经内科NCU、甲状腺乳腺外科病房、甲状腺外科二病区、甲状腺乳腺外科三病区）
04-07 仁济楼（神经外科、神经外科NCU、胃肠痔漏外科）
04-09 仁济楼（心血管外科、胸外科、口腔科、泌尿外科）
04-13 北院新增科室 疼痛科 
04-13 仁济楼（肝胆胰外科一病区、肝胆胰外科二病区、骨外科病房、骨外科二病区、血管外科、疝与腹壁外科病房、消化内科一病区、消化内科二病区、消化内科监护室、仁济楼16楼）
04-14 仁济楼（妇科一病区、妇科二病区、母婴同室一病区、母婴同室二病区、新生儿重症监护室、重症医学科）
04-22 后湖院区（呼吸内科一区、呼吸内科二区、呼吸内科监护室）
04-23 后湖院区（心血管内科一区、心血管内科二区、心血管内科CCU）
05-04 后湖院区（妇科二病区、泌尿外科病房、口腔科、神经外科、神经内科一区、神经内科二区、（神外口腔合并病区））
05-05 后湖院区（母婴同室一病区、母婴同室二病区、耳鼻咽喉科、内分泌一病区、内分泌二病区）
05-06 后湖院区（肝胆胰疝外科、胃肠外科、骨外科、甲乳外科一区、甲乳外科二区）
05-07 后湖院区（重症医学科、消化内科一区、消化内科二区、消化科监护室）
05-15 谌家矶（综合一、二）
05-21 南院 急诊病房
05-25 后湖 (病区)急诊病房（后湖），(病区)急诊外科病房（后湖），(病区)急诊内科病房（后湖），(病区)急诊EICU（后湖）
*/


















GO


